# Prediction of Stock Price Movement based on trading

In [2]:
import pandas as pd
import numpy as np
import datetime
import seaborn as sns
df=pd.read_csv('DataFrame.csv')
msft=pd.read_csv('MSFT.csv')

# Data cleaning

In [3]:
df.head()

    Type      Date   Time      open      high       low     close  Unnamed: 7
0  NIFTY  20210101  09:16  13997.90  14020.85  13991.35  14013.15         NaN
1  NIFTY  20210101  09:17  14014.85  14018.55  14008.15  14009.05         NaN
2  NIFTY  20210101  09:18  14008.05  14013.10  14005.05  14012.70         NaN
3  NIFTY  20210101  09:19  14013.65  14019.10  14013.65  14016.20         NaN
4  NIFTY  20210101  09:20  14015.45  14017.80  14011.95  14015.45         NaN

In [4]:
msft.head()

         Date      Open      High       Low     Close  Adj Close      Volume
0  1986-03-13  0.088542  0.101563  0.088542  0.097222   0.061751  1031788800
1  1986-03-14  0.097222  0.102431  0.097222  0.100694   0.063956   308160000
2  1986-03-17  0.100694  0.103299  0.100694  0.102431   0.065059   133171200
3  1986-03-18  0.102431  0.103299  0.098958  0.099826   0.063405    67766400
4  1986-03-19  0.099826  0.100694  0.097222  0.098090   0.062302    47894400

In [5]:
df.info

<bound method DataFrame.info of         Type      Date   Time      open      high       low     close  \
0      NIFTY  20210101  09:16  13997.90  14020.85  13991.35  14013.15
1      NIFTY  20210101  09:17  14014.85  14018.55  14008.15  14009.05
2      NIFTY  20210101  09:18  14008.05  14013.10  14005.05  14012.70
3      NIFTY  20210101  09:19  14013.65  14019.10  14013.65  14016.20
4      NIFTY  20210101  09:20  14015.45  14017.80  14011.95  14015.45
...      ...       ...    ...       ...       ...       ...       ...
22800  NIFTY  20210331  15:27  14687.35  14694.35  14686.30  14690.60
22801  NIFTY  20210331  15:28  14690.90  14690.90  14686.05  14689.30
22802  NIFTY  20210331  15:29  14690.30  14694.10  14688.55  14691.30
22803  NIFTY  20210331  15:30  14689.85  14693.55  14689.45  14693.05
22804  NIFTY  20210331  15:31  14690.70  14690.70  14690.70  14690.70

       Unnamed: 7
0             NaN
1             NaN
2             NaN
3             NaN
4             NaN
...           ...
22800         NaN
22801         NaN
22802         NaN
22803         NaN
22804         NaN

[22805 rows x 8 columns]>

In [6]:
msft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8857 entries, 0 to 8856
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       8857 non-null   object
 1   Open       8857 non-null   float64
 2   High       8857 non-null   float64
 3   Low        8857 non-null   float64
 4   Close      8857 non-null   float64
 5   Adj Close  8857 non-null   float64
 6   Volume     8857 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 484.5+ KB

In [7]:
missing_df=df.isnull().sum()
missing_msft=msft.isnull().sum()

In [8]:
missing_df

Type              0
Date              0
Time              0
open              0
high              0
low               0
close             0
Unnamed: 7    22805
dtype: int64

In [9]:
missing_msft

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [10]:
#dropping the column with null values
df.drop('Unnamed: 7',axis=1,inplace=True)

In [11]:
df[df.duplicated()]

Empty DataFrame
Columns: [Type, Date, Time, open, high, low, close]
Index: []

In [12]:
msft[msft.duplicated()]

Empty DataFrame
Columns: [Date, Open, High, Low, Close, Adj Close, Volume]
Index: []

In [13]:
df['Date']=pd.to_datetime(df['Date'],format="%Y%m%d")

In [14]:
df

        Type       Date   Time      open      high       low     close
0      NIFTY 2021-01-01  09:16  13997.90  14020.85  13991.35  14013.15
1      NIFTY 2021-01-01  09:17  14014.85  14018.55  14008.15  14009.05
2      NIFTY 2021-01-01  09:18  14008.05  14013.10  14005.05  14012.70
3      NIFTY 2021-01-01  09:19  14013.65  14019.10  14013.65  14016.20
4      NIFTY 2021-01-01  09:20  14015.45  14017.80  14011.95  14015.45
...      ...        ...    ...       ...       ...       ...       ...
22800  NIFTY 2021-03-31  15:27  14687.35  14694.35  14686.30  14690.60
22801  NIFTY 2021-03-31  15:28  14690.90  14690.90  14686.05  14689.30
22802  NIFTY 2021-03-31  15:29  14690.30  14694.10  14688.55  14691.30
22803  NIFTY 2021-03-31  15:30  14689.85  14693.55  14689.45  14693.05
22804  NIFTY 2021-03-31  15:31  14690.70  14690.70  14690.70  14690.70

[22805 rows x 7 columns]

# Exploratory Data Anlysis

In [15]:
df.describe()

               open          high           low         close
count  22805.000000  22805.000000  22805.000000  22805.000000
mean   14703.322396  14707.486481  14699.102201  14703.260816
std      391.377498    391.265231    391.551643    391.366248
min    13604.750000  13614.400000  13596.750000  13602.800000
25%    14462.250000  14465.950000  14458.050000  14461.950000
50%    14739.500000  14743.000000  14735.850000  14739.450000
75%    15037.000000  15041.250000  15032.500000  15036.850000
max    15429.500000  15431.750000  15427.900000  15430.200000

In [16]:
msft.describe()

,Open,High,Low,Close,Adj Close,Volume
count,8857.000000,8857.000000,8857.000000,8857.000000,8857.000000,8.857000e+03
mean,34.831233,35.209355,34.449657,34.840895,29.886536,5.953411e+07
std,44.060163,44.513443,43.597704,44.080986,44.195101,3.858121e+07
min,0.088542,0.092014,0.088542,0.090278,0.057340,2.304000e+06
25%,3.843750,3.875000,3.812500,3.851563,2.446323,3.559720e+07
50%,26.590000,26.879999,26.290001,26.590000,18.686628,5.269680e+07
75%,36.730000,37.000000,36.110001,36.660000,27.218300,7.339520e+07
max,261.660004,263.190002,260.170013,261.970001,261.970001,1.031789e+09

# sampling from dataframes

In [20]:
sample1=df.sample(n=5,replace=5)
print(sample1)

        Type       Date   Time      open      high       low     close
17809  NIFTY 2021-03-10  14:10  15171.15  15179.45  15171.00  15179.45
16050  NIFTY 2021-03-04  10:03  15035.35  15043.80  15035.25  15043.60
22541  NIFTY 2021-03-31  11:08  14737.75  14738.70  14736.50  14737.15
7460   NIFTY 2021-01-29  13:57  13747.70  13749.30  13743.10  13748.85
2405   NIFTY 2021-01-11  11:35  14427.90  14428.75  14426.55  14428.30

In [21]:
sample2=msft.sample(n=5,replace=5)
print(sample2)

            Date       Open       High        Low      Close  Adj Close  \
16    1986-04-07   0.096354   0.097222   0.092882   0.094618   0.060097
356   1987-08-10   0.360243   0.361111   0.355903   0.359375   0.228257
5739  2008-12-11  20.110001  20.120001  19.309999  19.450001  14.767466
5874  2009-06-26  23.570000  23.690001  23.320000  23.350000  17.963469
3798  2001-03-23  27.468750  28.500000  27.187500  28.281250  17.962852

        Volume
16    16560000
356   56448000
5739  83564300
5874  65126400
3798  99519600